<?php
    //function userFunction(){
        // объявление текстовых переменных
        $text1 = "не определено"; 
        $text2 = "не определено";
        $str0 = "\nAJAX-Форма на домашнем сайте \"Яндекс.Такси\" \n(выполнил студент Вадим Щеблыкин) \n";
        $str = "\n\n(просьба открывать данный файл под названием forma.txt в приложении Notepad++, \nпоскольку в обычном блокноте все файлы открываются в кодировке ANSI, а файл forma.txt сохранён в кодировке utf-8)";
        $str1 = "\nФИО: ";
        $str2 = "\n\nТелефон: ";

        // проверка (с помощью функции isset()) поля fio на наличие в ней данных (если поле fio будет пустое, то в файл ничего не будет записано)
        if(isset($_POST["fio"])){ 
            $text1 = trim($_POST["fio"]); // функция trim() убирает по умолчанию все пробелы в начале и в конце полученной ею строки
        } // проверка поля telefon на наличие в ней данных (если поле telefon будет пустое, то в файл ничего не будет записано)
        if(isset($_POST["telefon"])){ 
            $text2 = trim($_POST["telefon"]);
        }
        
        /* из-за того, что ВС КОД не мог мне показать, что нужно было поставить одинарные кавычки перед и после записи w+ в функции fopen(), я несколько дней 
        понять не мог, почему у меня ничего в текстовый файл не записывается (а оказалось, что файл server.php просто понять не мог, каким образом открыть нужно было блокнот: 
        либо только для чтения, либо для новой записи, либо для редактирования).
        А теперь ясно, что я даже этот несчастный текстовый файл не смогу создать нв своём компе, если у меня будет выключен OSPanel, и сайт будет запущен не через этот сервер */
        $file = fopen("forma.txt", 'w+') or die("не удалось создать файл"); // создать файл forma.txt с возможностью записи текста (без редактирования при повторном запуске программы заново)

        // запись принятых от формы данных в файл в виде двух строк
        fwrite($file, $str0);
        fwrite($file, $str1.$text1); // $str1.$text1 -- это склеивание двух строк с помощью точки
        fwrite($file, $str2.$text2);
        fwrite($file, $str);

        fclose($file);

        $to      = "vadim.shcheblykin2002@gmail.com";
        $subject = $str0;
        $message = $str1.$text1.$str2.$text2;
        $headers = "От кого: vadim.shcheblykin2002@gmail.com";

        mail($to, $subject, $message, $headers);
    //}
?>